Documents/ПриостановкаИзделияЗаказчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриостановкаИзделияЗаказчика</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЗаказчика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЗаказчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ГлабольныеСостояниеКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ГлабольныеСостояниеКомплекта</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГлобальныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИзделиеЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийСостояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧастичныйСтатус</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТаймингЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТаймингЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СбросСчетчика</Name>
					<Comment>0 не изменяет,, 1 доработка, 2 корректировка, 4 изменение,</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УвеличениеСчетчика</Name>
					<Comment>0 не изменяет,, 1 доработка, 2 корректировка, 4 изменение</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГлобальнаяПауза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйПровал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйУспех</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаЗадача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеГЧ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пауза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоМалярка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоМалярка2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоОтгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоПодрядчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоПодрядчик2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСтолярка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСтолярка2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСтолярка3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Редакция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рекламация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РКД_ожидание_согласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стоп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗВнешнееОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗВнутреннееОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗРекламация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальнаяПриостановкаРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальнаяПродолжениеРаботы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПриостановкаИзделияЗаказчика/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Проект = ПриложениеКДоговору.Проект;
	
	ТаблицаКомплектыИзделия 	= омИзделиеЗаказчика.ПолучитьПодчиненыеКомплектыИзделийЗаказчика(ИзделияЗаказчика.Выгрузить().ВыгрузитьКолонку("ИзделиеЗаказчика")); 
    ТаблицаСтатусов 			= ПолучитьТекущиеСтатусы(ТаблицаКомплектыИзделия);
	ТаблицаПроводок 			= ПолучитьТаблицуПроведения();
	ТаблицаТекущиеПриостановки	= ПолучитьТекущиеПриостановки(Проект);
	
	СтруктураОтборИзделие 	= Новый Структура("ИзделиеЗаказчика", );
	СтруктураОтборКомплект 	= Новый Структура("Комплект", );
	
	Для каждого ТекущиеИзделиеЗаказчика Из ИзделияЗаказчика Цикл
		
		СтруктураОтборИзделие.ИзделиеЗаказчика = ТекущиеИзделиеЗаказчика.ИзделиеЗаказчика;
	
		СтруктураКомплеты = ПолучитьДанныеОКомплектах(ТаблицаКомплектыИзделия, ТаблицаСтатусов, ТаблицаТекущиеПриостановки, СтруктураОтборИзделие, СтруктураОтборКомплект);			
	
	КонецЦикла;
	
	Движения.ГлабольныеСостояниеКомплекта.Записывать = Истина;
	Для Каждого ТекСтрокаПроводки Из ТаблицаПроводок Цикл
		Движение = Движения.ГлабольныеСостояниеКомплекта.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаПроводки);
		Движение.Период 				= ДатаПриостановки;
		Движение.ГлобальныйСтатус 		= Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы;
		Движение.Проект 				= Проект;
	КонецЦикла;

КонецПроцедуры 

Функция ПолучитьТаблицуПроведения()

	МасиивТипов = Новый Массив;
	МасиивТипов.Добавить(Тип("СправочникСсылка.ИзделияКомплект"));
	МасиивТипов.Добавить(Тип("СправочникСсылка.Композиции"));
	
	ТаблицаПроводок = Новый ТаблицаЗначений;
	ТаблицаПроводок.Колонки.Добавить("Комплект", 			Новый ОписаниеТипов(МасиивТипов));
	ТаблицаПроводок.Колонки.Добавить("ИзделиеЗаказчика", 	Новый ОписаниеТипов("СправочникСсылка.ИзделияЗаказчика"));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущийСостояние", Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЗадач"));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущийСтатус", 	Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЗадач"));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущийТипЗадачи", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадачКонструирования"));
	ТаблицаПроводок.Колонки.Добавить("ЧастичныйСтатус", 	Новый ОписаниеТипов("Булево"));
	
КонецФункции // ПолучитьТаблицуПроведения()


Функция ПолучитьДанныеОКомплектах(ТаблицаКомплектыИзделия, ТаблицаСтатусов, ТаблицаТекущиеПриостановки, СтруктураОтборИзделие, СтруктураОтборКомплект)

	мКомплекты = Новый Массив;
	
	НайденыеСтроки = ТаблицаКомплектыИзделия.НайтиСтроки(СтруктураОтборИзделие);
	
	Для каждого х Из НайденыеСтроки Цикл
	
		Если мКомплекты.Найти(х.Комплект) = Неопределено Тогда
		
			мКомплекты.Добавить(х.Комплект);
			
			
		
		КонецЕсли;	
	
	КонецЦикла;
                                                	
КонецФункции // ТекущиеИзделиеЗаказчика() 

Функция ПолучитьТекущиеПриостановки(Проект)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГлабольныеСостояниеКомплектаСрезПоследних.Комплект КАК Комплект,
		|	ГлабольныеСостояниеКомплектаСрезПоследних.ИзделиеЗаказчика КАК ИзделиеЗаказчика
		|ИЗ
		|	РегистрСведений.ГлабольныеСостояниеКомплекта.СрезПоследних(&ДатаПриостановки, ) КАК ГлабольныеСостояниеКомплектаСрезПоследних
		|ГДЕ
		|	ГлабольныеСостояниеКомплектаСрезПоследних.Проект = &Проект";
	
	Запрос.УстановитьПараметр("Проект", 			Проект);
	Запрос.УстановитьПараметр("ДатаПриостановки", 	ДатаПриостановки);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТекущиеПриостановки()



Функция ПолучитьТекущиеСтатусы(ТаблицаКомплектыИзделия)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадачСрезПоследних.Задача КАК Задача,
		|	ТаймингЗадачСрезПоследних.Задача.ОбъектТЗ КАК ЗадачаОбъектТЗ,
		|	ТаймингЗадачСрезПоследних.Состояние КАК Состояние,
		|	ТаймингЗадачСрезПоследних.Статус КАК Статус,
		|	ТаймингЗадачСрезПоследних.ТипЗадачи КАК ТипЗадачи
		|ИЗ
		|	РегистрСведений.ТаймингЗадач.СрезПоследних(, Задача.ОбъектТЗ В (&ОбъектТЗ)) КАК ТаймингЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ТаблицаКомплектыИзделия.ВыгрузитьКолонку("Комплект"));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
